Revit 2020 API
Entity.Get Method
Overload List
Name | Description
Get<FieldType>(String)
 Retrieves the value of the field in the entity.
Get<FieldType>(Field)
 Retrieves the value of the field in the entity.
Get<FieldType>(String, DisplayUnitType)
 Retrieves the value of the field in the entity.
Get<FieldType>(Field, DisplayUnitType)
 Retrieves the value of the field in the entity.
See Also
Entity Class
Entity Members
Autodesk.Revit.DB.ExtensibleStorage Namespace